{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality yet.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including search functionality, category filtering, INR currency conversion, location selector enhancements, and expanded restaurant listings with associated files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files describing components, pages, contexts, and configuration for the food delivery application.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes, defining a warm color palette for the food delivery app theme.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the React application.",
  "frontend/src/App.tsx": "Main application component configuring TanStack Router with routes for home, restaurant detail, and all restaurants pages, wrapped with LocationProvider, CartProvider, and ProfileMenuProvider.",
  "frontend/src/components/CartIcon.tsx": "Shopping bag icon button with badge displaying cart item count that opens the cart sidebar when clicked.",
  "frontend/src/components/CartSidebar.tsx": "Sliding sidebar displaying cart items with quantity controls, remove buttons, and price breakdown in INR including subtotal, delivery fee, tax, and total with checkout button.",
  "frontend/src/components/CategoryFilter.tsx": "Horizontal scrollable filter with 8 category buttons (Pizza, Chinese, Fast Food, etc.) using Lucide icons, supporting active state and category selection.",
  "frontend/src/components/Header.tsx": "Fixed header with Food Hub logo, location selector, search input (desktop and mobile), profile icon, and cart icon with responsive layout.",
  "frontend/src/components/LocationModal.tsx": "Modal dialog component for setting delivery location, supporting both manual address entry and geolocation-based detection with error handling.",
  "frontend/src/components/LocationSelector.tsx": "Button component displaying current delivery address with icon and dropdown indicator, opens LocationModal on click.",
  "frontend/src/components/LoginPrompt.tsx": "Displays a login prompt with Internet Identity authentication button and welcome message for unauthenticated users.",
  "frontend/src/components/MenuCategory.tsx": "Renders a restaurant menu category with title and list of menu items, passing restaurantId to each MenuItem.",
  "frontend/src/components/MenuItem.tsx": "Displays individual menu item card with image, name, description, price, and add-to-cart button.",
  "frontend/src/components/ProfileIcon.tsx": "User icon button that toggles the profile menu sidebar when clicked.",
  "frontend/src/components/ProfileMenu.tsx": "Sidebar component showing user profile information, saved addresses management, and logout functionality; displays LoginPrompt when not authenticated.",
  "frontend/src/components/RestaurantCard.tsx": "Clickable card component displaying restaurant preview with image, rating, delivery time, cuisines, and distance information.",
  "frontend/src/components/RestaurantInfo.tsx": "Card component displaying detailed restaurant information including rating, address, phone number, and operating hours.",
  "frontend/src/components/SearchBar.tsx": "Search input component with search icon, clear button, and customizable placeholder for filtering restaurants and dishes.",
  "frontend/src/contexts/CartContext.tsx": "React context providing shopping cart state management with add/remove/update operations, price calculations, and cart visibility control.",
  "frontend/src/contexts/LocationContext.tsx": "React context managing delivery address state with localStorage persistence for maintaining user location across sessions.",
  "frontend/src/contexts/ProfileMenuContext.tsx": "React context managing profile menu sidebar visibility state with toggle functionality.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous actor for backend communication, invalidating dependent queries when the actor changes based on Internet Identity authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flows, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Reserved placeholder file for React Query hooks that will interact with the backend; currently empty with mock data used elsewhere.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm, food-focused color palette for light and dark modes, plus utility classes for scrollbar hiding.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/AllRestaurantsPage.tsx": "Displays a searchable, scrollable list of all restaurants (15 mock entries) with back navigation, search bar, and restaurant cards showing ratings, delivery times, and cuisines.",
  "frontend/src/pages/HomePage.tsx": "Main landing page with hero section, category filters, searchable restaurant grid (14 mock restaurants), and footer with social links; supports filtering by cuisine categories.",
  "frontend/src/pages/RestaurantDetailPage.tsx": "Restaurant detail page showing banner image, restaurant info (ratings, hours, contact), and categorized menu items with prices; uses route params to load restaurant data from mock object.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with CSS variables, container settings, border radius utilities, custom shadows, Inter font family, and animation keyframes. Includes plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file for a food ordering app UI (version 7) with architectural notes about Zomato/Swiggy-inspired design, INR currency, profile menu, location functionality, and existing features including home page, restaurant details, cart, navigation header, and profile management."
}